LearningProjectSample/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "user_id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Test"], ["user_id", 2], ["title", "Nathan"], ["created_at", "2016-06-30 20:59:38.919074"], ["updated_at", "2016-06-30 20:59:38.919074"]]