LearningProjectSample/app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
  <p><%= post.body %></p>
  <% post.comments.each do |comment| %>